"""
HR数据处理系统配置文件
包含所有系统配置和数据映射规则
"""
import os
from dataclasses import dataclass
from typing import Tuple
from enum import Enum

class EmployeeType(Enum):
    # 用工性质枚举
    CONTRACT = '合同制'
    COOPERATE_B = '业务合作B'
    COOPERATE = '业务合作'
    OUTSOURCED = '外包'
    DISPATCH = '派遣'

# 系统常量
TARGET_COLUMNS = [
    '部门/区县名称', 'BU/营服名称', '姓名', '性别', '年龄', 
    '用工性质', '最高学历', '岗位名称'
]

@dataclass
class FileConfig:
    # 文件配置类
    base_path: str = r"D:\人事文件\3.人事工作（202307-202312）\1.人事工作\1.人员管理\1.人员信息\2. 四透明数据\2. 月度情况（含岗位）\2025"
    output_folder: str = "./output"

    def get_monthly_files(self, month:int) -> Tuple[str, str, str]:
        month_str = f"{month:02d}"
        file1 = os.path.join(self.base_path, f"(25.{month_str})智家b模式.xlsx")
        file2 = os.path.join(self.base_path, f"(25.{month_str})自有外包.xlsx")
        output = os.path.join(self.base_path, f"(25.{month_str})合并人员信息.xlsx")
        return file1, file2, output

class DataMappings:
    # 部门名称映射
    DEPARTMENT_MAPPING = {
        '客户事业群揭阳市分部': '参考二级组织',
        '党委办公室（办公室、工会、法律部、安全监管部）': '办公室',
        '党委组织部（人力资源与企业发展部）': '人力部',
        '客户服务部': '客服部',
        '党委宣传部（党委统战部、党群工作部）': '党群部',
        '揭阳办事处': '产互',
        '纪委驻揭阳市分公司纪律检查组': '纪检组'
    }
    
    # 二级组织映射
    SECONDARY_ORG_MAPPING = {
        '': '政企统筹',
        '政企客户事业群揭阳市分部政要战略客户部': '政要',
        '政企客户事业群揭阳市分部企业战略客户部': '企业',
        '政企客户事业群揭阳市分部新型工业化事业部': '工业',
        '政企客户事业群揭阳市分部商企营销部': '政企统筹',
        '政企客户事业群揭阳市分部物联网运营BU': '政企统筹',
        '政企客户事业群揭阳市分部智网业务BU': '政企统筹',
        '政企客户事业群揭阳市分部移网业务BU': '政企统筹'
    }
    
    # 特殊人员部门映射
    SPECIAL_STAFF_MAPPING = {
        '孙建雄': '安全专班', '林华六': '安全专班', '林淡辉': '安全专班', '邱晓强': '安全专班',
        '陈创周': '外派-公安局反诈中心', '魏广涛': '外派-公安局反诈中心', 
        '王少武': '外派-公安局反诈中心', '邓小东': '外派-公安局反诈中心',
        '李忠': '外派-通建办', '卢鸿生': '外派-通建办',
        '蔡纯德': '普宁分公司', '赖沛伟': '普宁分公司', '赖锦顺': '普宁分公司',
        '吴喜坤': '揭东区分公司', '潘锦庭': '揭东区分公司', '林旭生': '揭东区分公司',
        '林昱': '安委办', '傅新宏': '安委办', '杨晓明': '安委办'
    }
    
    # 一线岗位列表
    FRONTLINE_SALE_POSITIONS = [
        '营业厅经理', '值班经理', '营业员', '渠道经理', '社区经理', '智慧家庭工程师',
        '校园经理', '分众客户经理', '分众团队经理', '业务村长', '楼长', '商企客户经理',
        '行业客户经理', '售前支撑岗', '售后响应岗', '交付售中岗', '投诉处理岗',
        '重大投诉处理岗', '投诉处理班组长', '门店运营经理', '营服总经理(小CEO)',
        '全量客户经理', '方案经理', '终端销售经理'
    ]

    # 一线部门列表
    FRONTLINE_FIRST_DEPARTMENTS = [
        '榕城区分公司', '揭东区分公司', '普宁分公司', '惠来县分公司', '揭西县分公司'
    ]
    FRONTLINE_SECOND_DEPARTMENTS = [
    ]


    # 学历映射
    EDUCATION_MAPPING = {
        '初中及以下': '高中以下', '高中': '高中以下', '其他': '高中以下',
        '中技': '高中以下', '中专': '高中以下',
        '大专': '大学专科', '专科': '大学专科',
        '大学': '大学本科', '本科': '大学本科', '无': '大学本科',
        '研究生': '硕士以上'
    }
